app/Controllers/Auth.php

    public function login()
    {
        helper(['form']);

        if ($this->session->get('isLoggedIn')) {
            return redirect()->to(base_url('dashboard'));
        }

        if ($this->request->getMethod() === 'POST') {
            $rules = [
                'email'    => 'required|valid_email',
                'password' => 'required'
            ];

            if ($this->validate($rules)) {
                $email = $this->request->getPost('email');
                $password = $this->request->getPost('password');

                $builder = $this->db->table('users');
                $user = $builder->where('email', $email)->get()->getRowArray();
---
SELECT *
FROM `users`
WHERE `email` = 'student@example.com'

    public function dashboard()
    {
        if (!$this->session->get('isLoggedIn')) {
            return redirect()->to(base_url('login'))->with('error', 'Please log in first.');
        }

        $user_id = $this->session->get('user_id');
        $user_name = $this->session->get('name');
        $user_role = $this->session->get('role');

        // Fetch all courses
        $courses = $this->db->table('courses')
            ->select('id, title, description')
            ->orderBy('title', 'ASC')
            ->get()
            ->getResultArray();

        // Fetch student enrolled courses
        $enrolledCourses = [];
        if ($user_role === 'student') {
            $enrolledCourses = $this->db->table('enrollments')
                ->select('courses.id, courses.title, courses.description')
                ->join('courses', 'enrollments.course_id = courses.id', 'left')
                ->where('enrollments.user_id', $user_id)
                ->get()
                ->getResultArray();
---
SELECT `id`, `title`, `description`
FROM `courses`
ORDER BY `title` ASC
SELECT `courses`.`id`, `courses`.`title`, `courses`.`description`
FROM `enrollments`
LEFT JOIN `courses` ON `enrollments`.`course_id` = `courses`.`id`
WHERE `enrollments`.`user_id` = '3'